---
type: StructuralSectionGeneralF
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionGeneralF

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralF | 2018 | `public StructuralSectionGeneralF ( double width , double height , double centroidHorizontal , double centroidVertical , StructuralSectionAnalysisParams analysisParams )` |